In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#import seaborn as sns
%matplotlib inline

In [2]:
df = pd.read_csv(r"C:\Users\HP\Desktop\datasets\titanic_train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.set_index("PassengerId")
df.index.name = None

In [5]:
df1 = df.copy()
df2 = df.copy()

In [6]:
df.drop(columns = {"Name", "Ticket", "Cabin"}, inplace = True)

In [7]:
df1.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [24]:
df.isnull().value_counts()

PassengerId  Survived  Pclass  Sex    Age    SibSp  Parch  Fare   Embarked
False        False     False   False  False  False  False  False  False       891
dtype: int64

In [9]:
mean_age = df['Age'].mean()
mean_age

29.69911764705882

In [10]:
df["Age"].replace([np.nan, mean_age], inplace = True )

In [11]:
commonval = df["Embarked"].value_counts().idxmax()

In [12]:
df["Embarked"].replace([np.nan,commonval], inplace = True )

In [13]:
df['Sex'].replace({'male':1, 'female':0}, inplace = True)

In [14]:
Embarked_dummies = pd.get_dummies(df["Embarked"])
df.drop(columns = {"Embarked"}, inplace = True)

In [15]:
df = pd.concat([df,Embarked_dummies], axis = 1)

In [16]:
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  C  Q  S
0            1         0       3    1  22.0      1      0   7.2500  0  0  1
1            2         1       1    0  38.0      1      0  71.2833  1  0  0
2            3         1       3    0  26.0      0      0   7.9250  1  0  0
3            4         1       1    0  35.0      1      0  53.1000  1  0  0
4            5         0       3    1  35.0      0      0   8.0500  1  0  0

In [18]:
from sklearn.ensemble import RandomForestClassifier
from xgboost import XGBClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import StandardScaler

In [19]:
target = df["Survived"]
df.drop(columns = {"Survived"}, inplace = True)

In [20]:
df.set_index("PassengerId", inplace = True)
df.index.name = None

In [21]:
xtrain,xtest,ytrain,ytest = train_test_split(df,target,test_size = 0.2, random_state = 1)

In [22]:
xtrain1,xtest1,ytrain1,ytest1 = train_test_split(df,target,test_size = 0.2, random_state = 1)

## Standard Scalerr

In [23]:
Scaler = StandardScaler()
xtrain = Scaler.fit_transform(xtrain)
xtest = Scaler.transform(xtest)

In [24]:
RFC1 = RandomForestClassifier()
RFC1.fit(xtrain,ytrain)
yhat_RFC1 = RFC1.predict(xtest)
print(accuracy_score(ytest,yhat_RFC1))

0.7597765363128491

## Min max scaler

In [25]:
from sklearn.preprocessing import Normalizer
normalizer = Normalizer()

In [58]:
xtrain1 = normalizer.fit_transform(xtrain1)
xtest1 = normalizer.transform(xtest)

In [59]:
RFC2 = RandomForestClassifier()
RFC2.fit(xtrain1,ytrain1)
yhat_RFC2 = RFC2.predict(xtest1)
print(accuracy_score(ytest1,yhat_RFC2))

0.6871508379888268

In [64]:
df_test = pd.read_csv(r"C:\Users\HP\Desktop\datasets\test.csv")
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [62]:
df_test1 = df_test.copy()

In [77]:
mean_fare_test = df_test1["Fare"].mean()
df_test1.isnull().value_counts()

Pclass  Sex    Age    SibSp  Parch  Fare   C      Q      S
False   False  False  False  False  False  False  False  False    418
dtype: int64

In [69]:
#df_test1.drop(columns = {"Name", "Ticket", "Cabin"}, inplace = True)
df_test1["Age"].replace([np.nan, mean_fare_test], inplace = True )
df_test1['Sex'].replace({'male':1, 'female':0}, inplace = True)
Embarked_dummies_test = pd.get_dummies(df_test1["Embarked"])
df_test1.drop(columns = {"Embarked"}, inplace = True)
df_test1 = pd.concat([df_test1,Embarked_dummies_test], axis = 1)

df_test1["Fare"].replace([np.nan, mean_fare_test], inplace = True )

df_test1.set_index("PassengerId", inplace = True)
df_test1.index.name = None

In [70]:
df_test1.head()

     Pclass  Sex   Age  SibSp  Parch     Fare  C  Q  S
892       3    1  34.5      0      0   7.8292  0  1  0
893       3    0  47.0      1      0   7.0000  0  0  1
894       2    1  62.0      0      0   9.6875  0  1  0
895       3    1  27.0      0      0   8.6625  0  0  1
896       3    0  22.0      1      1  12.2875  0  0  1

In [73]:
df_test1_scaler_transform = df_test1.copy()
df_test1_scaler_fit_transform = df_test1.copy()

In [78]:
df_test1_scaler_transform = Scaler.transform(df_test1_scaler_transform)
df_test1_scaler_fit_transform = Scaler.fit_transform(df_test1_scaler_fit_transform)

In [79]:
prediction_fit_transform = RFC1.predict(df_test1_scaler_fit_transform)
prediction_transform = RFC1.predict(df_test1_scaler_transform)

In [81]:
prediction_fit_transform = pd.DataFrame(prediction_fit_transform)

In [83]:
sample = pd.read_csv(r'C:\Users\HP\Desktop\datasets\gender_submission.csv')
sample.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [86]:
pass_id = pd.DataFrame(df_test["PassengerId"])
pass_id.head()

   PassengerId
0          892
1          893
2          894
3          895
4          896

In [1]:
prediction_fit_transform = pd.concat([prediction_fit_transform, pass_id], axis = 1)
#prediction_fit_transform = prediction_fit_transform [sample.columns]

In [99]:
#prediction_fit_transform1 = prediction_fit_transform[["PassengerId", 0]]
prediction_fit_transform1.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [98]:
prediction_fit_transform1.rename(columns = {0:"Survived"}, inplace = True)

In [100]:
prediction_fit_transform1.to_csv(r'C:\Users\HP\Desktop\datasets\Titanic\submission2.csv', index = False)